import React from 'react';

const StateVSProps = () => {
      return (
            <div>
                         <div>
                        {/* state */}
                        <h1>State Vs Props</h1>
                         <h2>State </h2>
      <p>State একটি আপডেটযোগ্য কাঠামো যা উপাদান সম্পর্কে ডেটা বা তথ্য ধারণ করতে ব্যবহৃত হয় এবং সময়ের সাথে সাথে পরিবর্তন হতে পারে। অবস্থার পরিবর্তন ব্যবহারকারীর  সিস্টেম ইভেন্টের প্রতিক্রিয়া হিসাবে ঘটতে পারে। এটি প্রতিক্রিয়া উপাদানের হৃদয় যা উপাদানটির আচরণ এবং এটি কীভাবে রেন্ডার করবে তা নির্ধারণ করে। একটি State যতটা সম্ভব সহজ রাখা আবশ্যক. এটি উপাদানটির স্থানীয় অবস্থা বা তথ্য উপস্থাপন করে। এটি শুধুমাত্র কম্পোনেন্টের ভিতরে বা সরাসরি কম্পোনেন্টের মাধ্যমে অ্যাক্সেস বা পরিবর্তন করা যেতে পারে।
                        </p>

                        {/* props */}
                        <h2>Props</h2>
       <p>Props শুধুমাত্র পঠনযোগ্য উপাদান। এটি এমন একটি অবজেক্ট যা ট্যাগের অ্যাট্রিবিউটের মান সঞ্চয় করে এবং HTML অ্যাট্রিবিউটের মতো কাজ করে। এটি একটি উপাদান থেকে অন্য উপাদানে ডেটা পাস করার অনুমতি দেয়। এটি ফাংশন আর্গুমেন্টের অনুরূপ এবং একটি ফাংশনে পাস করা আর্গুমেন্টের মতো একইভাবে উপাদানে প্রেরণ করা যেতে পারে। Props গুলি অপরিবর্তনীয় তাই আমরা উপাদানের ভিতরে থেকে প্রপগুলি পরিবর্তন করতে পারি না।
                        </p>
                        
                        {/* how react works */}
                        <h1>How react Works</h1>
                        <p>React কিভাবে কাজ করে?
React প্রথমেই একটা ব্রাউজারের ডমের মতো দেখতে একই আরেকটা ডম তৈরী করে যেটাকে ভার্চুয়াল ডম বলা হয়। এখন এই ডম দেখতে পুরো সেই আসল ডমের মতোই, কিন্তু এই ভার্চুয়াল ডমটা আসলে একটা জাভাস্ক্রিপ্ট অবজেক্ট। রিঅ্যাক্ট এটাকে এমনভাবে তৈরী করে যে এই ডমের সাথে সহজেই জাভাস্ক্রিপ্ট ইউজ করে যেকোনো ইলিমেন্ট মডিফাই করা যায় কম সময়ের মধ্যে। এখন আগেরটার সাথে ভার্চুয়াল ডমের তুলনা করে রিঅ্যাক্ট দেখে আসলে নতুন কোন ইলিমেন্ট পরিবর্তন করা হয়েছে। সে অনুসারে রিঅ্যাক্ট পুরো ডমটাকে রি-রেন্ডার না করে শুধুমাত্র যেই জিনিসটা চেঞ্জ হয়েছে সেটাকেই চেঞ্জ করে। এতে সহজেই দ্রুত কাজ হয়ে যায় আর অতিরিক্ত, অপ্রয়োজনীয় কোনো কাজও করতে হয় না ব্রাউজারের। আর এভাবেই, এই টেকনিক ইউজ করেই রিঅ্যাক্ট এতো দ্রুত রেন্ডার করে কাজ করে।</p>
       </div>
            </div>
            

      
      );
};

export default StateVSProps;